<template>
	<view class="content">
		<h2 class="title">亭好住用户注册协议</h2>
		<text class="con">如果您选择接受本条款，即表示您同意接受协议各项条件的约束。如果您不同意本服务条款，则不能获得使用本协议的权利。您若有违反本条款规定，亭好住有权随时中止或终止您对亭好住产品的使用资格并保留追究相关法律责任的权利。本协议条款一旦发生变更，亭好住将在网页上公布修改内容。修改后的服务条款一旦在网页上公布即有效代替原来的服务条款。您可随时登录亭好住官方网站查阅最新版服务条款。</text>
		<h2 class="other">一、产品保护条款</h2>
		<view class="con">1、亭好住产品是归属亭好住公司版权所有。亭好住产品的一切版权以及与亭好住产品相关的所有信息内容，包括但不限于：文字表述及其组合、图标、图饰、图表、色彩、版面设计、数据、印刷材料、或电子文档等均受著作权法和国际著作权条约以及其他知识产权法律法规的保护。</view>
		<view class="con">2、您须明白，使用本协议产品涉及到互联网服务，可能会受到各个环节不稳定因素的影响。因此服务存在不可抗力、计算机病毒或黑客攻击、系统不稳定、用户所在位置、用户关机以及其他任何技术、互联网络、通信线路原因等造成的服务中断或不能满足用户要求的风险。您须承担以上风险，亭好住不作担保。
</view>
		<view class="con">3、如亭好住的系统发生故障影响到本协议的正常运行，亭好住承诺在第一时间内与相关单位配合，及时处理进行修复。但您因此而产生的经济损失，亭好住不承担责任。此外，亭好住保留不经事先通知为维修保养、升级或其他目的暂停本协议任何部分的权利。</view>
		<view class="con">4、使用本协议必须遵守国家有关法律和政策等，维护国家利益，保护国家安全，并遵守本条款，对于您违法或违反本条款的使用(包括但不限于言论发表、传送等)而引起的一切责任，由您负全部责任，概与亭好住及合作单位无关，导致亭好住及合作单位损失的，亭好住及合作单位有权要求赔偿，并有权立即停止向其提供服务，保留相关记录，并保留配合司法机关追究法律责任的权利。
</view>
		<view class="con">5、作记录信息和其他一切个人隐私信息范围外的普通信息。亭好住将会采取合理的措施保护您的个人隐私信息，除法律或有法律赋予权限的政府部门要求或您同意等原因外，亭好住未经您同意不向除合作单位以外的第三方公开、 透露您个人隐私信息。您同意，为了运营和改善亭好住的技术和服务，亭好住可以在无须再另行通知或提示您的情况下，自己收集使用或向第三方提供使用您的非个人隐私信息，以有助于亭好住及合作单位向用户提供更好的用户体验和提高服务质量。</view>
		<h2 class="other">二、用户使用须知</h2>
		<view class="con">特别提醒您，使用互联网必须遵守国家有关的政策和法律，如刑法、国家安全法、保密法、计算机信息系统安全保护条例等，保护国家利益，保护国家安全，对于违法使用互联网络而引起的一切责任，由您负全部责任。</view>
		<view class="con">1、您不得使用亭好住产品发送或传播任何妨碍社会治安或非法、虚假、骚扰性、侮辱性、恐吓性、伤害性、破坏性、挑衅性、淫秽色情性等内容的信息。
</view>
		<view class="con">2、您不得使用亭好住产品发送或传播敏感信息和违反国家法律制度的信息。
</view>
		<view class="con">3、您保证以真实的身份注册使用亭好住的产品，向亭好住所提供的个人身份资料信息真实、完整、有效，依据法律规定和约定对所提供的信息承担相应的法律责任。如果资料发生变化，您应及时更改。亭好住会及时、有效地提供该项服务。在安全完成本协议的登记程序后，您应维持密码及账号的机密安全。您应对任何人利用您的密码及账号所进行的活动负完全的责任，亭好住公司无法对非法或未经您授权使用您账号及密码的行为做出甄别，因此亭好住公司不承担任何责任。
</view>
		<view class="con">4、盗取他人号码或利用网络通讯骚扰他人，均属于非法行为。您不得采用测试、欺骗等任何非法手段，盗取其他用户的账号和对他人进行骚扰。
</view>
		<view class="con">5、亭好住在此郑重提请您注意，任何经由本协议以上传、下载、张贴、电子邮件或任何其他方式传送的资讯、资料、文字、软件、音乐、音讯、照片、图形、视讯、信息、用户的登记资料或其他资料等（以下简称“内容”），无论系公开还是私下传送，均由内容提供者承担责任。同时，为了提高、改进亭好住各种服务的用户体验，您同意亭好住对凡是您经由本服务通过上传、张贴等任何方式发布到亭好住产品的任何文字、图片及其他信息资料等进行无偿的修改、复制、传播等使用。亭好住无法监控经由本协议传送之内容，也无法对用户的使用行为进行全面控制，因此不保证内容的合法性、正确性、完整性、真实性或品质等；您已预知使用本服务时，可能会接触到令人不快、不适当或令人厌恶之内容，并同意将自行加以判断并承担所有风险，而不依赖于亭好住。但在任何情况下，亭好住公司有权依法停止任何前述内容的服务并采取相应行动，包括但不限于暂停用户使用本协议的全部或部分，保存有关记录，并向有关机关报告。但亭好住有权(但无义务)依其自行之考量，拒绝和删除可经由本协议提供之违反本条款的或其他引起亭好住或其他用户反感的任何内容。
</view>
		<view class="con">6、亭好住产品属于群体类产品，使用亭好住软件产品服务的用户之间引发的任何纠纷亭好住公司将不负责任。</view>
		<h2 class="other">三、用户付费协议</h2>
		<view class="con">为保障用户权益，请用户在付费之前，详细阅读此服务协议（以下简称“本协议”）所有内容。亭好住已经发布的或将来可能发布的各类规则,均为本协议不可分割的组成部分，与协议正文具有同等法律效力。</view>
		<view class="con">1、用户在亭好住有偿获得课程内容或服务时，用户需先登录或注册亭好住帐号，或通过页面提示选用其他可用帐号进行登录。用户在使用亭好住服务时登录的帐号是确认您身份的唯一依据。
</view>
		<view class="con">2、用户理解并同意：亭好住提供有偿内容或服务实行先付款后使用的方式，用户及时、足额、合法的支付所需的款项，是您使用亭好住有偿内容或服务的前提。
</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				
			}
		},
		methods: {
			
		}
	}
</script>

<style scoped lang="scss">
.content{
	width: 90%;
	height: 90%;
	margin: auto;
	.title{
		margin-top: 20px;
		margin-bottom: 10px;
		font-size: 19px;
	}
	.con{
		box-sizing: border-box;
		font-size: 16px;
		color: #71777D;
		font-family: $uni-color-paragraph;
		line-height: 25px;
		margin-top: 20px;
		text-align: left;
	}
	.other{
		margin-top: 20px;
		margin-bottom: 10px;
		font-size: 19px;
	}
}
</style>
