export default [
	["琅珊街道", "丰山街道", "清流街道", "扬子街道", "西涧街道", "遵阳街道", "滁阳街道", "三官街道"],
	["龙蟠街道", "银花街道", "同乐街道", "大王街道", "乌衣镇", "沙河镇", "章广镇", "黄泥岗镇", "珠龙镇", "大柳镇", "腰铺镇", "施集镇"],
	["广陵街道", "千秋街道", "铜城镇", "汉涧镇", "秦栏镇", "大通镇", "杨村镇", "石梁镇", "金集镇", "永丰镇", "仁和集镇", "冶山镇", "郑集镇", "张铺镇", "新街镇", "万寿镇"],
	["明光街道", "明东街道", "明南街道", "明西街道", "张八岭镇", "三界镇", "管店镇", "自来桥镇", "涧溪镇", "石坝镇", "苏巷镇", "桥头镇", "女山湖镇", "古沛镇", "潘村镇",
		"柳巷镇", "泊岗乡"
	],
	["新安镇", "半塔镇", "水口镇", "汉河镇", "大英镇", "雷官镇", "施官镇", "舜山镇", "三城镇", "独山镇", "张山镇", "杨郢乡"],
	["襄河镇", "古河镇", "大墅镇", "二郎口镇", "武岗镇", "马厂镇", "石沛镇", "十字镇", "西王镇", "六镇镇"],
	[],
	[],
]
